In [1]:
import pandas as pd

In [5]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data)
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   8  10  11  12
3  13  14  15  16

In [17]:
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [18]:
# Podemos criar uma lista também com o .split()
# Passamos em ums str os itens, separados por espcaço

In [19]:
# Quando selecionamos apenas uma coluna, gera uma Series do Pandas
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [20]:
# Quando selecionamos duas ou mais colunas, gera um DataFrame
df[['c1','c3']]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

In [21]:
# Para selecionar linhas
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [22]:
# E para selecionar a linha de index 2 e 3 e a coluna de index 1 e 2
df[2:][['c1', 'c2']]

    c1  c2
l3   8  10
l4  13  14

In [24]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [25]:
# Com o ,loc[] podemos selecionar os itens por linha e coluna
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [26]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [28]:
df.loc['l1', 'c2']

2

In [29]:
# o .loc[] utiliza o nome da linha e da coluna
# o .icol[] utiliza o valor do index de cada linha e coluna
df.iloc[0, 1]

2

In [30]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [32]:
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   8
l1   4   1